{
    "home": "Home",
    "benefits": "Benefits",
    "ourclasses": "Our Classes",
    "contactus": "Contact Us",
    "signIn": "Sign In",
    "becomeMember": "Become a member",
    "joinNow": "Join Now",
    "learnMore": "Learn More",
    "home.textMessage": "Courses specially designed for children by specialists in the field.",
    "benefits.title": "What we offer?",
    "benefits.one.title": "Experienced Trainers",
    "benefits.one.description": "Our instructors boast extensive backgrounds in both teaching and industry, having served as software engineers at renowned global companies. Their wealth of experience ensures that your child receives top-notch guidance in their programming journey.",
    "benefits.two.title": "Interactive Learning Environment",
    "benefits.two.description": "We foster an engaging atmosphere where kids learn programming through hands-on experiences with robots, interactive games, and user-friendly sofware tools. This approach ensures a fun and effective learning experience.",
    "benefits.three.title": "Personalized Learning Paths",
    "benefits.three.description": "Recognizing that every child is unique, we tailor our curriculum to accommodate various learning styles. This personalized approach helps each student progress at their own pace, building a solid foundation in programming.",
    "benefits.four.title": "Creativity Unleashed",
    "benefits.four.description": "Our courses are designed to spark creativity. Through game development and robot programming, kids explore their imaginative potential, turning abstract concepts into exciting and tangible projects.",
    "benefits.five.title": "Lifelong Skills Development",
    "benefits.five.description": "Beyond coding, we focus on instilling problem-solving, critical thinking, and teamwork skills. These essential life skills empower your child, preparing them for success in the digital age.",
    "benefits.six.title": "Safe and Supportive Community",
    "benefits.six.description": "We prioritize creating a safe and supportive community where kids feel encouraged to express themselves. Collaboration and positive interactions are fostered, promoting a nurturing environment for effective learning.",
    "benefits.text.title.partOne": "Îngrijind Mințile Tinere, Eliberând ",
    "benefits.text.title.partTwo": "VIITORII",
    "benefits.text.title.partThree": "Inovatori",
    "benefits.text.paragraph.one": "În școala noastră vibrantă de programare pentru copii, deschidem calea creșterii intelectuale a copilului tău printr-o serie de beneficii captivante. Instruitorii noștri experimentați, provenind din companii tech globale de prestigiu, îi ghidează pe cei mici cu o expertiză de neegalat, asigurând o călătorie în programare bogată și recompensatoare. Imaginează-ți bucuria din ochii copilului tău pe măsură ce se implică într-un mediu de învățare interactiv, unde programarea devine o aventură plină de roboți, jocuri interactive și instrumente software prietenoase. Aici, fiecare copil începe un traseu de învățare personalizat, îmbrățișându-și unicitatea și construind o bază solidă în programare în ritmul propriu. Dincolo de liniile de cod, cursurile noastre sunt meticulos concepute pentru a elibera creativitatea lor, transformând concepte abstracte în proiecte tangibile precum dezvoltarea de jocuri și programarea de roboți, cultivând dragostea pentru inovație și rezolvarea de probleme.",
    "benefits.text.paragraph.two": "Ca părinți, puteți urmări transformarea în timp real. Imaginați-vă copilul nu doar stăpânind abilitățile de programare, ci și dezvoltând abilități de viață cruciale precum gândirea critică, rezolvarea problemelor și colaborarea, pregătindu-i pentru succes în peisajul digital în continuă evoluție. Comunitatea noastră sigură și de susținere încurajează autoexprimarea, colaborarea și interacțiunile pozitive, creând un mediu în care copilul tău prosperă. Înscrierea copilului tău în școala noastră de programare nu este doar o investiție în abilitățile lor tehnice; este o angajare în a îngriji un individ bine rotunjit, creativ și împuternicit, pregătit să modeleze viitorul cu încredere și inovație.",
    "ourclasses.class.one.name": "Scratch Module 1",
    "ourclasses.class.one.description": "Introduction to Scratch programming for beginners. Kids will learn the basics of coding through interactive and creative projects. This module focuses on building a strong foundation in programming using the Scratch platform.",
    "ourclasses.class.two.name": "Scratch Module 2",
    "ourclasses.class.two.description": "Building on the fundamentals learned in Scratch Module 1, this advanced class delves deeper into coding concepts. Kids will create more complex games and animations, enhancing their problem-solving skills and creativity.",
    "ourclasses.class.three.name": "Robot Adventures",
    "ourclasses.class.three.description": "A hands-on class where kids explore the world of robotics. Using kid-friendly robots, they will learn to program and control these bots to navigate through challenges. This class encourages logical thinking and introduces the principles of robotics in a playful manner.",
    "ourclasses.class.four.name": "Game Design Galore",
    "ourclasses.class.four.description": "An exciting class that introduces kids to the world of game design. Using user-friendly game development tools, kids will unleash their creativity to design and build their own interactive games. This class fosters a love for storytelling, logic, and game mechanics.",
    "ourclasses.class.five.name": "Creative Coding Creations",
    "ourclasses.class.five.description": "In this class, kids use a variety of programming tools designed for young learners to create unique and imaginative projects. From animated stories to interactive art, this class encourages creative expression through coding.",
    "ourclasses.class.tbd.name": "To BE ANNOUNCED",
    "ourclasses.title": "OUR CLASSES",
    "ourclasses.paragraph": "Embark on engaging journeys into the world of knowledge through our specialized classes! From introductory coding modules in Scratch, taking the first steps into the coding universe, to interactive adventures in robotics or digital artistic creations, each class is an opportunity for exploration and enjoyable learning. We provide a diverse range of lessons tailored to age and interests, fostering creativity, critical thinking, and practical skill development. We look forward to providing our children with an enchanting educational experience and guiding them in the discovery of their passions."
    
  }
  