{
    "home": "Acasă",
    "benefits": "Beneficii",
    "ourclasses": "Cursurile Noastre",
    "contactus": "Contactează-ne",
    "enroll": "Inscrieri",
    "signIn": "Inscrie-te",
    "becomeMember": "Inscrie-ti copilul",
    "joinNow": "Înscrie-ți Copilul Acum",
    "learnMore": "Detalii",
    "price": "Pret",
    "name": "NUME",
    "phoneNumber": "NUMAR DE TELEFON",
    "message": "MESAJ",
    "submit": "TRIMITE",
    "defaultPhoneNumber": "(+40) 777 777 777",
    "monday": "Luni",
    "tuesday": "Marti",
    "wednesday": "Miercuri",
    "thursday": "Joi",
    "friday": "Vineri",
    "saturday": "Sambata",
    "sunday": "Duminica",
    "weekly": "Saptamanal",
    "monthly": "Lunar",
    "age": "Varsta",
    "interval": "Interval",
    "home.textMessage": "Un mediu educativ în care copiii sunt încurajați să-și exploreze pasiunile, să învețe prin joacă și să se dezvolte în indivizi curioși și încrezători. Cu o echipă dedicată de profesori, creăm un loc unde fiecare copil poate să-și dezvolte potențialul într-un mod unic și inspirat. La Școala Noastră, nu doar învățăm - modelăm viitorul împreună!",
    "benefits.title": "Ce oferim?",
    "benefits.one.title": "Instruitori Experimentați",
    "benefits.one.description": "Instructorii noștri se mândresc cu experiențe extinse atât în predare, cât și în industrie, având funcții de ingineri de software la companii globale de renume. Bogăția lor de experiență asigură că copilul tău primește îndrumare de cea mai înaltă calitate în călătoria lor de programare.",
    "benefits.two.title": "Mediu Interactiv de Învățare",
    "benefits.two.description": "Promovăm o atmosferă captivantă în care copiii învață programare prin experiențe practice cu roboți, jocuri interactive și instrumente software prietenoase. Această abordare asigură o experiență de învățare distractivă și eficientă.",
    "benefits.three.title": "Trasee de Învățare Personalizate",
    "benefits.three.description":  "Recunoscând că fiecare copil este unic, adaptăm curriculumul nostru pentru a se potrivi diferitelor stiluri de învățare. Această abordare personalizată ajută fiecare elev să progreseze în ritmul său, construind o bază solidă în programare.",
    "benefits.four.title": "Creativitate Eliberată",
    "benefits.four.description": "Cursurile noastre sunt concepute pentru a stârni creativitatea. Prin dezvoltarea de jocuri și programare de roboți, copiii explorează potențialul lor imaginațional, transformând concepte abstracte în proiecte captivante și tangibile.",
    "benefits.five.title": "Dezvoltarea Abilităților pe Tot Parcursul Vieții",
    "benefits.five.description": "Pe lângă codare, ne concentrăm pe insuflarea abilităților de rezolvare a problemelor, gândire critică și colaborare. Aceste abilități de viață esențiale împuternicesc copilul tău, pregătindu-l pentru succes în era digitală.",
    "benefits.six.title": "Comunitate Sigură și de Suport",
    "benefits.six.description": "Prioritizăm crearea unei comunități sigure și de susținere în care copiii se simt încurajați să se exprime. Colaborarea și interacțiunile pozitive sunt încurajate, promovând un mediu de învățare eficient și îngrijitor.",
    "ourclasses.class.one.name": "Scratch Modul 1",
    "ourclasses.class.one.description": "Introducere în programarea Scratch pentru începători. Copiii vor învăța elementele de bază ale programării prin proiecte interactive și creative. Acest modul se concentrează pe construirea unei baze solide în programare folosind platforma Scratch.",
    "ourclasses.class.one.price": "500RON/luna",
    "ourclasses.class.one.ageInterval": "8-10 ani",
    "ourclasses.class.two.name": "Scratch Modul 2",
    "ourclasses.class.two.description": "Dezvoltând fundamentele învățate în Scratch Modul 1, această clasă avansată explorează în profunzime conceptele de programare. Copiii vor crea jocuri și animații mai complexe, îmbunătățindu-și abilitățile de rezolvare a problemelor și creativitatea.",
    "ourclasses.class.two.price": "450RON/luna",
    "ourclasses.class.two.ageInterval": "8-10 ani",
    "ourclasses.class.three.name": "Aventuri cu Roboți",
    "ourclasses.class.three.description": "O clasă practică în care copiii explorează lumea robotică. Utilizând roboți prietenoși pentru copii, ei vor învăța să programeze și să controleze acești roboți pentru a naviga prin provocări. Această clasă încurajează gândirea logică și introduce principiile robotică într-un mod jucaus.",
    "ourclasses.class.three.ageInterval": "8-10 ani",
    "ourclasses.class.three.price": "500RON/luna",
    "ourclasses.class.four.name": "Dezvoltare de Aplicații Mobile cu App Inventor",
    "ourclasses.class.four.ageInterval": "8-12 ani",
    "ourclasses.class.four.description": "Descoperă lumea fascinantă a dezvoltării de aplicații mobile cu App Inventor, un instrument puternic creat de MIT. Asemănător cu Scratch, dar mai complex, acest curs le oferă copiilor posibilitatea de a crea aplicații pentru Android printr-un mod vizual și accesibil. Chiar dacă nu dețin un telefon cu Android, vor putea utiliza un simulator pe calculator. În acest curs, copiii vor învăța să dezvolte aplicații interactive, stimulând creativitatea și dezvoltând abilități esențiale în programare.",
    "ourclasses.class.four.price": "500RON/luna",
    "ourclasses.class.five.name": "Programare în Python pentru Începători",
    "ourclasses.class.five.ageInterval": "10-15 ani",
    "ourclasses.class.five.description": "În această clasă, copiii își vor dezvolta abilitățile de programare folosind limbajul Python, ideal pentru începători. De la concepte de bază până la proiecte mai avansate, această clasă îi încurajează pe copii să exploreze și să creeze prin intermediul codului. De la povești interactive la jocuri simple, această clasă îi ajută să-și exprime creativitatea într-un mod captivant.",
    "ourclasses.class.five.price": "400RON/luna",
    "ourclasses.class.tbd.name": "De Anunțat",
    "ourclasses.title": "CLASELE NOASTRE",
    "ourclasses.paragraph": "Bucură-te de călătorii captivante în lumea cunoașterii prin clasele noastre specializate! De la module de programare în Scratch, care fac primii pași în universul codului, până la aventuri interactive în robotică sau creații artistice digitale, fiecare clasă este o ocazie de explorare și învățare plăcută. Oferim lecții diversificate, adaptate vârstei și intereselor, încurajând creativitatea, gândirea critică și dezvoltarea abilităților practice. Așteptăm cu nerăbdare să le oferim copiilor noștri o experiență educațională încântătoare și să-i ghidăm în descoperirea pasiunilor lor.",
    "contactus.paragraph": "Descoperă oportunitățile de învățare captivante pentru copilul tău. Alătură-te acum și pregătește-l pentru o călătorie plină de descoperiri și succes! Pentru detalii suplimentare și înscrieri, contactează-ne la adresa de e-mail sau numărul de telefon de mai jos.",
    "footer.paragraph": "Prin experiențe interactive și distractive, încurajăm mintea copiilor, oferindu-le un mediu sigur și captivant pentru învățare. Alătură-te nouă în construirea unui viitor mai luminos pentru educația copilului tău.",
    "footer.copyright": "© Toate drepturile rezervate.",
    "footer.link.title": "Link-uri",
    "footer.link.first": "Primul link",
    "footer.link.second": "Al doilea link",
    "footer.link.third": "Al treilea link",
    "footer.contactus.title": "Contactează-ne",
    "footer.contactus.paragraph.first": "Pentru întrebări detaliate vă rugăm să sunați la următorul număr:",
    "enroll.scheduledClasses": "Clase Programate",
    "enroll.class.startDate": "incepand din",
    "enroll.class.startTime": "Ora de start",
    "enroll.class.endTime": "Ora de final",
    "enroll.class.frequency": "Frecventa",
    "enroll.class.dayOfWeek": "Zi a saptamanii",
    "enroll.class.each": "in fiecare",
    "enroll.class.between": "intre",
    "enroll.class.age": "Varsta",
    "enroll.class.remainingSeats": "Locuri ramase",
    "enroll.class.lastSeatAvailable": "ULTIMUL LOC DISPONIBIL",
    "enroll.scheduledClasses.moreDetails": "Contactati-ne pentru intrebari legate de posibile alte dati de incepere ale cursurilor din viitor.",
    "enroll.defaultClassSelectionMessage": "Nicio clasa selectata din cele programate",
    "error.requiredField": "Acest camp este obligatoriu.",
    "error.max100Chars": "Maximum 100 caractere.",
    "error.max2000Chars": "Maximum 2000 caractere.",
    "error.invalidEmail": "Adresa email invalida.",
    "error.invalidPhoneNumber": "Numar de telefon invalid.",
    "error.noSeatsAvailable": "Nu exista locuri disponibile pentru aceasta clasa"
  }
  