{
    "home": "Acasă",
    "benefits": "Beneficii",
    "ourclasses": "Cursurile Noastre",
    "contactus": "Contactează-ne",
    "signIn": "Inscrie-te",
    "becomeMember": "Devin-o membru",
    "joinNow": "Alatura-te acum",
    "learnMore": "Detalii",
    "home.textMessage": "Cursuri special gandite pentru copii de catre specialisti in domeniu.",
    "benefits.title": "Ce oferim?",
    "benefits.one.title": "Instruitori Experimentați",
    "benefits.one.description": "Instructorii noștri se mândresc cu experiențe extinse atât în predare, cât și în industrie, având funcții de ingineri de software la companii globale de renume. Bogăția lor de experiență asigură că copilul tău primește îndrumare de cea mai înaltă calitate în călătoria lor de programare.",
    "benefits.two.title": "Mediu Interactiv de Învățare",
    "benefits.two.description": "Promovăm o atmosferă captivantă în care copiii învață programare prin experiențe practice cu roboți, jocuri interactive și instrumente software prietenoase. Această abordare asigură o experiență de învățare distractivă și eficientă.",
    "benefits.three.title": "Trasee de Învățare Personalizate",
    "benefits.three.description":  "Recunoscând că fiecare copil este unic, adaptăm curriculumul nostru pentru a se potrivi diferitelor stiluri de învățare. Această abordare personalizată ajută fiecare elev să progreseze în ritmul său, construind o bază solidă în programare.",
    "benefits.four.title": "Creativitate Eliberată",
    "benefits.four.description": "Cursurile noastre sunt concepute pentru a stârni creativitatea. Prin dezvoltarea de jocuri și programare de roboți, copiii explorează potențialul lor imaginațional, transformând concepte abstracte în proiecte captivante și tangibile.",
    "benefits.five.title": "Dezvoltarea Abilităților pe Tot Parcursul Vieții",
    "benefits.five.description": "Pe lângă codare, ne concentrăm pe insuflarea abilităților de rezolvare a problemelor, gândire critică și colaborare. Aceste abilități de viață esențiale împuternicesc copilul tău, pregătindu-l pentru succes în era digitală.",
    "benefits.six.title": "Comunitate Sigură și de Suport",
    "benefits.six.description": "Prioritizăm crearea unei comunități sigure și de susținere în care copiii se simt încurajați să se exprime. Colaborarea și interacțiunile pozitive sunt încurajate, promovând un mediu de învățare eficient și îngrijitor."

  }
  